Documents/ПартииВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПартииВСД</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСД_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВСД_Хозсубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПартииВСД/Forms/ФормаДокумента/Ext/Form/Module.bsl
// GRACE:MODULE_START name="ПартииВСД"
// @grace-module: ПартииВСД
// @grace-purpose: Форма документа ПартииВСД — загрузка партий из ВетИС по площадке и дате через API
// @grace-depends: ПартииВСД, ЯдроВСД, ИнтеграцияВетИС_API
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ПартииВСД"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"
// GRACE:DEPENDENCY target="ВетИС_КлиентскийСлойКлиент"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ВетИС_ПараметрыСервер.ПолучитьОрганизациюПоУмолчанию();
	Объект.Дата = ТекущаяДатаСеанса();
	ЗаполнитьРеквизитыПоОрганизации(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВетИС_КлиентскийСлойКлиент.УстановитьОтборыДинамическихСписковПриОткрытии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыПоОрганизации(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПартии(Команда)
	
	ОчиститьСообщения();
	ПолучитьПартииНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыПоОрганизации(Объект)
	
	СписокПараметров = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Объект.Организация);
	Объект.ВСД_Хозсубъект = СписокПараметров["Отправитель_ХозСубъект"];
	Объект.ВСД_Площадка = СписокПараметров["Отправитель_Площадка"];
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПартииНаСервере()
	
	ПараметрыФункции = ВетИС_ЯдроСервер.ЗагрузитьПараметры(Объект.Организация);
	ПараметрыФункции.Вставить("ВыбПлощадка", Объект.ВСД_Площадка);
	ПараметрыФункции.Вставить("ПартииСмещение", 0);
	ПараметрыФункции.Вставить("УдалятьПартии", Ложь);
	ПараметрыФункции.Вставить("ТолькоАктуальныеПартии", Ложь);
	ПараметрыФункции.Вставить("ПартияНачПериода", "");
	ПараметрыФункции.Вставить("ПартияКонПериода", Объект.Дата);
	ПараметрыФункции.Вставить("СписокПартий", Новый Массив);
	
	// LLM_NOTE: Отправка запроса на получение партий из ВетИС API.
	// В зависимости от параметра ОтправлятьВФоне — синхронный или фоновый вызов.
	// После вызова записывается ДатаАктуальностиПартий в справочник площадки.
	Если ПараметрыФункции.ОтправлятьВФоне Тогда
		ИдентификаторЗадания = Неопределено;
		
		НаименованиеЗадания = НСтр("ru = 'Ветис загрузка партий'");
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне( УникальныйИдентификатор,
		"ВетИС_APIСервер.Партии2_Запрос_Отправить_ВФоне",
		ПараметрыФункции,
		НаименованиеЗадания);
		
		АдресХранилища = Результат.АдресХранилища;
	Иначе;
		Ответ = ВетИС_APIСервер.Партии2_Запрос_Отправить(ПараметрыФункции);
		Результат = Новый Структура;
		Результат.Вставить("ЗаданиеВыполнено", Истина);
	КонецЕсли;
	
	ВСД_Площадка = Объект.ВСД_Площадка.ПолучитьОбъект();
	ВСД_Площадка.ДатаАктуальностиПартий = Объект.Дата;
	ВСД_Площадка.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВСД_Партия.Ссылка КАК Партия,
	|	ВСД_Партия.НомерЗаписи КАК НомерЗаписи,
	|	ВСД_Партия.ДатаИзготовления1 КАК ДатаИзготовления,
	|	ВСД_Партия.ДатаСрокГодности1 КАК СрокГодности,
	|	ВСД_Партия.Количество КАК Количество
	|ИЗ
	|	Справочник.ВСД_Партия КАК ВСД_Партия
	|ГДЕ
	|	ВСД_Партия.Ссылка В (&СписокПартий)";
	Запрос.УстановитьПараметр("СписокПартий", ПараметрыФункции.СписокПартий);
	
	Объект.ПартииРезультат.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры
// GRACE:MODULE_END name="ПартииВСД"
